In [1]:
import pandas as pd 
import numpy as np

x=pd.read_csv("Data/train.csv")
len(x)

df=pd.DataFrame(x)
cat_count = df.groupby('Pclass').count()[['PassengerId']]
cat_count

survived=df[df['Survived']==1]
cat_count_survived = survived.groupby('Pclass').count()[['PassengerId']]
cat_count_survived


surv_rate=cat_count_survived['PassengerId']/cat_count['PassengerId']
surv_rate

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: PassengerId, dtype: float64

In [2]:
highPaid=df[df.Fare == df.Fare.max()]
highPaid

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

In [3]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
df.Age

fixed=df.Age.fillna(df.Age.median())
fixed

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
5      28.0
6      54.0
7       2.0
8      27.0
9      14.0
10      4.0
11     58.0
12     20.0
13     39.0
14     14.0
15     55.0
16      2.0
17     28.0
18     31.0
19     28.0
20     35.0
21     34.0
22     15.0
23     28.0
24      8.0
25     38.0
26     28.0
27     19.0
28     28.0
29     28.0
       ...
861    21.0
862    48.0
863    28.0
864    24.0
865    42.0
866    27.0
867    31.0
868    28.0
869     4.0
870    26.0
871    47.0
872    33.0
873    47.0
874    28.0
875    15.0
876    20.0
877    19.0
878    28.0
879    56.0
880    25.0
881    33.0
882    22.0
883    28.0
884    25.0
885    39.0
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [5]:
sv=df['Survived']==1
aged=df['Age']>60
aged_survivers=df[sv & aged].sort_values(by=['PassengerId'])
aged_survivers

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
570,571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

In [6]:
mean_Pclass_Embarked=df.groupby(['Pclass','Embarked']).Fare.mean()
mean_Pclass_Embarked
sd_Pclass_Embarked=df.groupby(['Pclass','Embarked']).Fare.std()
sd_Pclass_Embarked

Pclass  Embarked
1       C           99.093935
        Q            0.000000
        S           58.811278
2       C           11.345067
        Q            0.000000
        S           13.630741
3       C            4.871528
        Q            6.721677
        S           13.276609
Name: Fare, dtype: float64

In [ ]:
df['Name']